# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 13  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [
   [-1, 1,EmptyLayer,[]],                       # 0
   [0, 1, SubInput, [0,3]],                     # 1
   [0, 1, SubInput, [3,6]],                     # 2
   #backbone 1,2:
   [1, 1, Conv, [64, 6, 2, 2]],                 # 3
   [2, 1, Conv, [64, 6, 2, 2]],                 # 4

   [-2, 1, Conv, [128, 3, 2]],                  # 5
   [-2, 1, Conv, [128, 3, 2]],                  # 6

   [-2, 3, C3, [128]],                          # 7
   [-2, 3, C3, [128]],                          # 8

   [[-2,-1], 1, AttentionFusion, [64]],         # 9

   [-3, 1, Conv, [256, 3, 2]],                  # 10
   [-2, 1, Conv, [256, 3, 2]],                  # 11

   [-2, 6, C3, [256]],                          # 12
   [-2, 6, C3, [256]],                          # 13

   [[-2,-1], 1, AttentionFusion, [128]],         # 14

   [-3, 1, Conv, [512, 3, 2]],                  # 15
   [-2, 1, Conv, [512, 3, 2]],                  # 16

   [-2, 9, C3, [512]],                          # 17
   [-2, 9, C3, [512]],                          # 18

   [[-2,-1], 1, AttentionFusion, [256]],        # 19

   [-3, 1, Conv, [1024, 3, 2]],                 # 20
   [-2, 1, Conv, [1024, 3, 2]],                 # 21

   [-2, 3, C3, [1024]],                         # 22
   [-2, 3, C3, [1024]],                         # 23

   [-2, 1, SPPF, [1024, 5]],                    # 24
   [-2, 1, SPPF, [1024, 5]],                    # 25

   [[-2, -1],1, AttentionFusion, [512]],        # 26
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],                  # 27
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 28
   [[-1,19], 1, Concat, [1]],                   # 29
   [-1, 3, C3, [512, False]],                   # 30

   [-1, 1, Conv, [256, 1, 1]],                  # 31
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 32
   [[-1,14], 1, Concat, [1]],                   # 33
   [-1, 3, C3, [256, False]],                   # 34

   [-1, 1, Conv, [256, 3, 2]],                  # 35
   [[-1, 31], 1, Concat, [1]],                  # 36
   [-1, 3, C3, [512, False]],                   # 37

   [-1, 1, Conv, [512, 3, 2]],                  # 38
   [[-1, 27], 1, Concat, [1]],                  # 39
   [-1, 3, C3, [1024, False]],                  # 40

   [[34, 37, 40], 1, Detect, [nc, anchors]],    # 41 Detect(P3, P4, P5)
  ]
